<?php

return [
    
    // Необходимо указать путь до Вашей папки моулей
    // к примеру это может быть /app/Modules или /app/Pokemons
    'path' => '/app/Modules',
    
    //Так же необходимо указать неймспейс для Вашей папки модулей
    'namespace' => 'App\Modules',
    
    //Здесь вы указываете ваши модули и их настройки
    //Дирректории для модулей необходимо создавать самостоятельно 
    'list' => [
        // 'BlogPost' => [
        //     'prefix' => 'blog-post',
        //     'routes' => ['web'],
        // ],

        // ...
    ]
];
